# ex2.4_1
#  В программе определите три следующие переменные:
# a = 7
# b = -4
# c = 3
# Выведите в консоль их значения, используя одну функцию print
# (между значениями переменных должен стоять один пробел).
#
# Sample Input:
#
# Sample Output:
# 7 -4 3
#
# a = 7
# b = -4
# c = 3
#
# print(a, b, c, sep=" ")


# ex2.4_2
# В программе определите три следующие переменные:
# a = 7
# b = -4
# c = 3
# Выведите в консоль их значения в столбик (каждое новое значение отображается с новой строчки),
# используя одну функцию print.
#
# Sample Input:
#
# Sample Output:
# 7
# -4
# 3
#
# a = 7
# b = -4
# c = 3
#
# print(a)
# print(b)
# print(c)

# ex2.4_3
# В программе определите две следующие строки:
#
# s1 = "Hello"
# s2 = "Balakirev"
# С помощью двух функций print (каждая отображает соответствующую строку)
# отобразите строки в консоли так, чтобы они шли друг за другом через пробел.
#
# Sample Input:
#
# Sample Output:
# Hello Balakirev
#
# s1 = "Hello"
# s2 = "Balakirev"
#
# print(s1, end=" ")
# print(s2)

# ex2.4_4
# Допишите программу, в которой вводятся два слова (в переменные s1 и s2)
# в одну строчку через пробел, и отображаются в консоли в формате:
# Word 1: s1 | Word 2: s2
#
# Sample Input:
#
# I love
# Sample Output:
#
# Word 1: I | Word 2: love

# ex2.4_5
#

# ex2.4_8
#

# ex2.4_9
#

# ex2.4_10
#

# ex2.4_11
#

# ex2.4_12
#
