# ex2.3_1
# Допишите текст программы для вычисления модуля введенного с клавиатуры числа в переменную d
# и вывода значения в консоль с помощью функции print.
#
# Sample Input:
# -5
#
# Sample Output:
# 5
#
# d = int(input())
# print(abs(d))


# ex2.3_2
#  Допишите текст программы для нахождения минимального значения из пяти введенных целых чисел
#  с выводом результата в консоль с помощью функции print.
#
# Sample Input:
# 8 11 -5 3 0
# Sample Output:
# -5
#
# d1, d2, d3, d4, d5 = map(int, input().split())
# print(min(d1, d2, d3, d4, d5))


import math

# ex2.3_5
# Допишите текст программы для вычисления евклидового расстояния (гипотенузы) по перемещениям a и b.
# Округлите результат с точностью до сотых. Полученное значение выведите на экран.
#
# Sample Input:
# 3 4
# Sample Output:
# 5.0
#
# a, b = map(int, input().split())
# print(round(math.sqrt(pow(a, 2) + pow(b, 2)), 3))
# print(math.sqrt(pow(a, 2) + pow(b, 2)))


# ex2.3_6
# Допишите программу для нахождения числа сочетаний из n по k (значения вводятся в программе),
# используя формулу. Выведите результат в консоль в виде целого числа с помощью функции print.
#
# Для вычисления факториалов воспользуйтесь соответствующей функцией из библиотеки math.
#
# Sample Input:
# 6 3
# Sample Output:
# 20
#
# n, k = map(int, input().split())
# formula = int(math.factorial(n) / (math.factorial(k) * math.factorial(n - k)))
# print(formula)


# ex2.3_7
#  В летний лагерь нужно отвести n детей и m вожатых с помощью автобусов.
#  Максимальная вместимость каждого автобуса 20 человек.
#  Допишите программу для вычисления минимального числа автобусов,
#  необходимых для перевозки детей вместе с вожатыми. Результат выведите в консоль в виде целого числа.
#
# Sample Input:
# 40 5
# Sample Output:
# 3
#
# n, m = map(int, input().split())
# print(math.ceil((n + m) / 20))


# ex2.3_8
# Гелевая ручка стоит x рублей. Сегодня магазин предоставляет скидку в 10% на каждую купленную ручку.
# Какое наибольшее количество таких ручек можно будет купить на 500 рублей?
# Результат выведите в консоль в виде целого числа.
#
# Sample Input:
# 20
# Sample Output:
# 27
#
x = int(input())
print(int(math.floor(500 / (x * 0.9))))

